#Напишите 4 переменных которые буду обозначать следующие данные:
#Количество выполненных ДЗ (запишите значение 12)
#№Количество затраченных часов (запишите значение 1.5)
#№Название курса (запишите значение 'Python')
#Время на одно задание (вычислить используя 1 и 2 переменные)
#Курс: Python, всего задач:12, затрачено часов: 1.5, среднее время выполнения 0.125 часа.

HW_tasks = 12
HW_hours = 1.5
Course_name = 'Phyton'
HW_run_time = HW_hours/HW_tasks

print(Course_name + ',', 'Всего задач:', HW_tasks, ',', 'Затрачено часов:', HW_hours, ',', 'Cреднее время выполнения:', HW_run_time)
