# 1st program
#возведение числа 9 в степень 0.5, после умножение на 5

print (9**0.5*5)

# 2st program
#9.99 больше 9.98 и 1000 не равно 1000.1 одновременно, выведете результат на экран(в консоль)

print(9.99>9.98 and 1000 != 1000.1)

# 3st program
#выведите на экран(в консоль) сумму серединных чисел исходных данных (23 и 67).

print(1234%1000//10 + 5678%1000//10)

# 4st program
#Дано два дробных числа: 13.42 и 42.13.Необходимо убедиться в том, что целая часть хотя бы одного из чисел равна дробной части другого.
print (int(13.42))
print (int(42.13*100%100))
print (int(13.42)==int(42.13*100%100))

print (int(13.42*100%100))
print (int(42.13))
print (int(13.42*100%100)==int(42.13))
